tsung_login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/work/tsung/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" cpu="8" maxusers="40000"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="10.254.138.106" port="80" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="10.136.54.28" type="munin"></monitor>
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="20" unit="minute">
     <users arrivalrate="50" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="100">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
   </option>
  </options>
  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <!-- full url with server name, this overrides the "server" config value -->
	<for from="1" to="60" var="i">
    <request><http url="http://10.136.58.197:8086/sdk/platform/login/api/login?jsonData={channel:%27xm%27,appid:%272882303761517480120%27,uid:%2783458722%27,token:%27IghChMuadhYi8n9G%27,serverIndex:%271%27}"></http>
    </request>
    </for>
  </session>
 </sessions>
</tsung>